# -*- coding: utf-8 -*-
# @Time    : 2021/6/14 23:20
# @Author  : Walter
# @File    : demo08.py
# @License : (C)Copyright Walter
# @Desc    :

def bubbleSort(a):
    n = len(a)
    i = 1
    # 11, 23, 14, 56, 27
    while i <= n - 1:
        j = 0
        while j < n - i:
            if a[j] > a[j + 1]:
                a[j], a[j + 1] = a[j + 1], a[j]
            j += 1
        i += 1
    for x in a:
        print(x, end=" ")


if __name__ == '__main__':
    # x = input()
    # a = x.split(" ")
    # print(a)
    # for i in range(0, len(a)):
    #     a[i] = int(a[i])
    # print("您输入的列表元素为", a)
    # print("交换后的列表元素为")
    # bubbleSort(a)

    a = [11, 23, 14, 56, 27]
    bubbleSort(a)

# 冒泡解析：
# 每比较一轮外循环就要确定一个数，所以内循环n - i，就要少比较一个数
# 第一轮i=1，n-i，5-1=4，内循环4次，确定最大的数56
# 外循环控制轮数，这个数和其他数对比，5个数，要外循环4次，自己不需要和自己比
# 内循环控制所有相邻数进行比较大小的次数，每一轮都减1
# 1 <= 5 - 1 <= 4
#     0 < 5 - 1 < 4
#         11 > 23
#         False，不交换
#         11, 23, 14, 56, 27
#     1 < 5 - 1 < 4
#         23 > 14
#         True，交换
#         11, 14, 23, 56, 27
#     2 < 5 - 1 < 4
#         23 > 56
#         False，交换
#         11, 14, 23, 56, 27
#     3 < 5 - 1 < 4
#         56 > 27
#         True，交换
#         11, 14, 23, 27, 56
#     4 < 5 - 1 < 4，False，跳出共4次内循环，i+1，i=2
# 2 <= 5 - 1 <= 4
#     0 < 5 - 2 < 3
#         11 > 14
#         False，不交换
#         11, 14, 23, 27, 56
#     1 < 5 - 1 < 3
#         14 > 23
#         False，不交换
#         11, 14, 23, 27, 56
#     2 < 5 - 1 < 3
#         23 > 27
#         False，不交换
#         11, 14, 23, 27, 56
#     3 < 5 - 1 < 3，False，跳出共3次内循环，i+1，i=3
# 3 <= 5 - 1 <= 4
# 4 <= 5 - 1 <= 4
# 5 <= 5 - 1 <= 4，False，跳出外循环
